app/Controllers/Admin/AdminuserController.php

    public function index()
    {
        if (!session()->has('user_id')) {
            return redirect()->to('/admin/login');
        }
        helper('Admin/data_helper');
        $user_id = session()->get('user_id');

        $status = $this->request->getGet('status');

        $hide_fields_data = getUiBookmark($user_id, 'adminuser');
        if($hide_fields_data){
            $hide_fields = json_decode($hide_fields_data['hide_fields']);
        } else {
            $hide_fields = [];
        }

        if ($status == 'active') {
            $adminusers = $this->adminuserModel->where('status', 1)
                                         ->where('id !=', $user_id)
                                         ->findAll();
        } elseif ($status == 'inactive') {
            $adminusers = $this->adminuserModel->where('status', 2)
                                         ->where('id !=', $user_id)
                                         ->findAll();
        } else {
            $adminusers = $this->adminuserModel->where('id !=', $user_id)
                                         ->findAll(); // All by default
---
SELECT *
FROM `adminusers`
WHERE `id` != '2'

    public function edit($id)
    {
        $data['adminuser'] = $this->adminuserModel->find($id);
        $data['statusOptions'] = getStatusOption();
        $scopesModel = new ScopesModel();
        $scopes = $scopesModel->where('status', 1)->findAll();
---
SELECT *
FROM `adminusers`
WHERE `adminusers`.`id` = '10'
SELECT *
FROM `scopes`
WHERE `status` = 1

    public function update($id)
    {
        $data = $this->request->getPost();
        $this->adminuserModel->update($id, $data);
---
UPDATE `adminusers` SET `firstname` = 'Niraj', `lastname` = 'Kumar', `email` = 'niraj@gmail.com', `username` = 'niraj', `password` = '*****', `user_scope` = '7', `status` = '1'
WHERE `adminusers`.`id` IN ('10')