app/Controllers/Admin/AuthController.php

SELECT *
FROM `adminusers`
WHERE `username` = 'niraj'
 LIMIT 1
---
    public function loginPost()
    {
        $session = session();
        $model = new AdminuserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $model->where('username', $username)->first();