app/Controllers/Admin/ProductController.php

SELECT *
FROM `products`
---
    public function index()
    {
        if (!session()->has('user_id')) {
            return redirect()->to('/admin/login');
        }
        if(!checkSuperAdmin() && !checkModuleInScope('Products')) { return redirect()->to('/admin/dashboard'); }
        $user_id = session()->get('user_id');

        $hide_fields_data = getUiBookmark($user_id, 'product');
        if($hide_fields_data){
            $hide_fields = json_decode($hide_fields_data['hide_fields']);
        } else {
            $hide_fields = [];
        }


        $productModel = new ProductModel();
        $status = $this->request->getGet('status');

        if ($status == 'active') {
            $products = $productModel->where('status', 1)->findAll();
        } elseif ($status == 'inactive') {
            $products = $productModel->where('status', 2)->findAll();
        } else {
            $products = $productModel->findAll(); // All by default