app/Controllers/Admin/QrController.php

    public function index()
    {
        if (!session()->has('user_id')) {
            return redirect()->to('/admin/login');
        }
        $user_id = session()->get('user_id');

        $status = $this->request->getGet('status');

        $hide_fields_data = getUiBookmark($user_id, 'qr');
        if($hide_fields_data){
            $hide_fields = json_decode($hide_fields_data['hide_fields']);
        } else {
            $hide_fields = [];
        }

        if ($status == 'active') {
            $qr_data = $this->qrDataModel->where('status', 1)
                                         ->findAll();
        } elseif ($status == 'inactive') {
            $qr_data = $this->qrDataModel->where('status', 2)
                                         ->findAll();
        } else {
            $qr_data = $this->qrDataModel->findAll(); // All by default
---
SELECT *
FROM `qr_data`

    public function view($id)
    {
        $data['qr_data'] = $this->qrDataModel->find($id);
        if($data['qr_data']['user_id']=='0') {
            $data['qr_data']['user_name'] = "Guest";
        }
        $data['qr_scan'] = $this->qrScanModel->where('qr_data_id', $id)->findAll();
---
SELECT *
FROM `qr_data`
WHERE `qr_data`.`id` = '2'
SELECT *
FROM `qr_scan`
WHERE `qr_data_id` = '2'