app/Helpers/Admin/data_helper.php

        function getUiBookmark($adminUserId, $slug){
            $uiBookmarkModel = new UiBookmarkModel();
            $uiBookmarkData = $uiBookmarkModel->where('grid_slug', $slug)
                                              ->where('admin_user_id', $adminUserId)
                                              ->first();
---
SELECT *
FROM `ui_bookmark`
WHERE `grid_slug` = 'product'
AND `admin_user_id` = '10'
 LIMIT 1

    function checkModuleInScope($module)
    {
        if (checkSuperAdmin()) {
            return true;
        }

        if (session()->has('scope')) {
            $scope = session()->get('scope');

            $scopesModel = new ScopesModel();
            $scopesData = $scopesModel->where('id', $scope)->first();
---
SELECT *
FROM `scopes`
WHERE `id` = '7'
 LIMIT 1

    function checkActionInScope($module, $action)
    {
        if (checkSuperAdmin()) {
            return true;
        }

        if (session()->has('scope')) {
            $scope = session()->get('scope');
            $scopesModel = new ScopesModel();
            $scopesData = $scopesModel->where('id', $scope)->first();
---
SELECT *
FROM `scopes`
WHERE `id` = '7'
 LIMIT 1